In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

Create a dataframe and assign it to a variable called army.

In [4]:
army =pd.DataFrame(raw_data)
army.head()

,armored,battles,company,deaths,deserters,origin,readiness,regiment,size,veterans
0,1,5,1st,523,4,Arizona,1,Nighthawks,1045,1
1,0,42,1st,52,24,California,2,Nighthawks,957,5
2,1,2,2nd,25,31,Texas,3,Nighthawks,1099,62
3,1,2,2nd,616,2,Florida,3,Nighthawks,1400,26
4,0,4,1st,43,3,Maine,2,Dragoons,1592,73

Set the 'origin' colum as the index of the dataframe

In [5]:
army.set_index("origin", inplace=True)

In [6]:
army.head()

,armored,battles,company,deaths,deserters,readiness,regiment,size,veterans
origin,,,,,,,,,
Arizona,1,5,1st,523,4,1,Nighthawks,1045,1
California,0,42,1st,52,24,2,Nighthawks,957,5
Texas,1,2,2nd,25,31,3,Nighthawks,1099,62
Florida,1,2,2nd,616,2,3,Nighthawks,1400,26
Maine,0,4,1st,43,3,2,Dragoons,1592,73

Print only the column veterans

In [7]:
army['veterans']

origin
Arizona         1
California      5
Texas          62
Florida        26
Maine          73
Iowa           37
Alaska        949
Washington     48
Oregon         48
Wyoming       435
Louisana       63
Georgia       345
Name: veterans, dtype: int64

Print the columns 'veterans' and 'deaths'

In [9]:
army[["veterans","deaths"]]

            veterans  deaths
origin
Arizona            1     523
California         5      52
Texas             62      25
Florida           26     616
Maine             73      43
Iowa              37     234
Alaska           949     523
Washington        48      62
Oregon            48      62
Wyoming          435      73
Louisana          63      37
Georgia          345      35

Print the name of all the columns.

In [10]:
army.columns

Index(['armored', 'battles', 'company', 'deaths', 'deserters', 'readiness',
       'regiment', 'size', 'veterans'],
      dtype='object')

Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [11]:
army.loc[['Maine', 'Alaska'], ['deaths', 'size', 'deserters']]

        deaths  size  deserters
origin
Maine       43  1592          3
Alaska     523   987         24

Select the rows 3 to 7 and the columns 3 to 6

In [13]:
army.iloc[2:7, 2:6]

        company  deaths  deserters  readiness
origin
Texas       2nd      25         31          3
Florida     2nd     616          2          3
Maine       1st      43          3          2
Iowa        1st     234          4          1
Alaska      2nd     523         24          2

Select every row after the fourth row and all columns

In [14]:
army.iloc[4:]

,armored,battles,company,deaths,deserters,readiness,regiment,size,veterans
origin,,,,,,,,,
Maine,0,4,1st,43,3,2,Dragoons,1592,73
Iowa,1,7,1st,234,4,1,Dragoons,1006,37
Alaska,0,8,2nd,523,24,2,Dragoons,987,949
Washington,1,3,2nd,62,31,3,Dragoons,849,48
Oregon,0,4,1st,62,2,2,Scouts,973,48
Wyoming,0,7,1st,73,3,1,Scouts,1005,435
Louisana,1,8,2nd,37,2,2,Scouts,1099,63
Georgia,1,9,2nd,35,3,3,Scouts,1523,345

Select every row up to the 4th row and all columns

In [15]:
army.iloc[:4]

,armored,battles,company,deaths,deserters,readiness,regiment,size,veterans
origin,,,,,,,,,
Arizona,1,5,1st,523,4,1,Nighthawks,1045,1
California,0,42,1st,52,24,2,Nighthawks,957,5
Texas,1,2,2nd,25,31,3,Nighthawks,1099,62
Florida,1,2,2nd,616,2,3,Nighthawks,1400,26

Select the 3rd column up to the 7th column

In [16]:
army.iloc[:, 2:7]

           company  deaths  deserters  readiness    regiment
origin
Arizona        1st     523          4          1  Nighthawks
California     1st      52         24          2  Nighthawks
Texas          2nd      25         31          3  Nighthawks
Florida        2nd     616          2          3  Nighthawks
Maine          1st      43          3          2    Dragoons
Iowa           1st     234          4          1    Dragoons
Alaska         2nd     523         24          2    Dragoons
Washington     2nd      62         31          3    Dragoons
Oregon         1st      62          2          2      Scouts
Wyoming        1st      73          3          1      Scouts
Louisana       2nd      37          2          2      Scouts
Georgia        2nd      35          3          3      Scouts

Select rows where df.deaths is greater than 50

In [17]:
ind = army["deaths"] >= 50
army.loc[ind, "deaths"]

origin
Arizona       523
California     52
Florida       616
Iowa          234
Alaska        523
Washington     62
Oregon         62
Wyoming        73
Name: deaths, dtype: int64

Select rows where df.deaths is greater than 500 or less than 50

In [18]:
death= (army["deaths"] > 500) | (army["deaths"] < 50)
army.loc[death, "deaths"]

origin
Arizona     523
Texas        25
Florida     616
Maine        43
Alaska      523
Louisana     37
Georgia      35
Name: deaths, dtype: int64

Select all the regiments not named "Dragoons"

In [19]:
ind= army["regiment"] != "Dragoons"
army.loc[ind, "regiment"]

origin
Arizona       Nighthawks
California    Nighthawks
Texas         Nighthawks
Florida       Nighthawks
Oregon            Scouts
Wyoming           Scouts
Louisana          Scouts
Georgia           Scouts
Name: regiment, dtype: object

Select the rows called Texas and Arizona

In [20]:
army.loc[["Arizona"], "deaths"]

origin
Arizona    523
Name: deaths, dtype: int64

Select the third cell in the row named Arizona

In [21]:
army.loc[["Arizona"], "deaths"]

origin
Arizona    523
Name: deaths, dtype: int64

Select the third cell down in the column named deaths

In [25]:
army.loc[2:,:'deaths']

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [2] of <class 'int'>